# Connect to DataBase

In [1]:
# Import libraries of interest 
import pandas as pd
import numpy as np 
import numpy.random as rand
import mysql.connector
import random
import math
import pymysql
import sqlalchemy
from sqlalchemy import create_engine

In [2]:
# Enter your password...
password = ...

In [3]:
# For using pd.read_sql
connection = pymysql.connect(
        host = '127.0.0.1',
        port =  3306,
        user = 'root',
        password = password,
        database = 'cville_climbs'
    )
cnx = create_engine('mysql+pymysql://root:'+password+'@localhost:3306/cville_climbs')

In [4]:
# Connect to SQL database on your computer for writing to SQL
conn = mysql.connector.connect(user='root', password=password, host='127.0.0.1', database='cville_climbs')
cursor = conn.cursor() # Enable access to mySQL

# Create Tables

In [18]:
# Remove all tables from database 
destroy_tables = '''
DROP TABLE IF EXISTS 
route, location, log, route_setting, person, route_setter, admin, climber 
'''
cursor.execute(destroy_tables)
conn.commit()

In [19]:
# Create location table 
create_location = '''
CREATE TABLE location 
(location_id INT NOT NULL AUTO_INCREMENT,
 latitude DECIMAL(10,8) NOT NULL,
 longitude DECIMAL(10,8) NOT NULL, 
 name VARCHAR(64) NOT NULL,
 entrance_city VARCHAR(255),
 entrance_zip VARCHAR(255),
 entrance_address VARCHAR(255),
 num_routes INT NOT NULL,
 PRIMARY KEY (location_id),
 CONSTRAINT Check_Location CHECK (-180<longitude AND longitude<180 AND -90<latitude AND latitude<90)
 )
'''
cursor.execute(create_location)
conn.commit()


# Create person table 
create_person = '''
CREATE TABLE person
(person_id INT NOT NULL AUTO_INCREMENT,
 f_name VARCHAR(32) NOT NULL,
 l_name VARCHAR(32) NOT NULL,
 email VARCHAR(64) NOT NULL,
 phone BIGINT(10) NOT NULL,
 PRIMARY KEY (person_id))
'''
cursor.execute(create_person)
conn.commit()


# Create route table
create_route = '''
CREATE TABLE route 
(route_id INT NOT NULL AUTO_INCREMENT, 
 name VARCHAR(64) NOT NULL, 
 difficulty DECIMAL NOT NULL,
 rating DECIMAL,
 type enum('indoor','outdoor') NOT NULL,
 location_id INT NOT NULL,
 PRIMARY KEY (route_id),
 FOREIGN KEY (location_id) REFERENCES location (location_id), 
 CONSTRAINT check_rating CHECK (rating>=0 AND rating<=10),
 CONSTRAINT check_difficulty CHECK (difficulty>=0 AND difficulty<=6))
'''
cursor.execute(create_route)
conn.commit()


# Create log table 
create_log = '''
CREATE TABLE log 
(log_id INT NOT NULL AUTO_INCREMENT, 
 person_id INT NOT NULL, 
 comment LONGTEXT NOT NULL,
 route_beta LONGTEXT,
 route_id INT NOT NULL,
 PRIMARY KEY (log_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id))
'''
cursor.execute(create_log)
conn.commit()


# Create route_setting table 
create_route_setting = '''
CREATE TABLE route_setting
(route_id INT NOT NULL,
 person_id INT NOT NULL,
 PRIMARY KEY (route_id, person_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id))
'''
cursor.execute(create_route_setting)
conn.commit()


# Create route setter table
create_route_setter = '''
CREATE TABLE route_setter
(person_id INT NOT NULL,
 n_routes_created INT NOT NULL,
 route_setting_exp_lvl DECIMAL NOT NULL,
 certifications LONGTEXT,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id))
'''
cursor.execute(create_route_setter)
conn.commit()


# Create climber table 
create_climber = '''
CREATE TABLE climber
(person_id INT NOT NULL,
 exp_lvl DECIMAL NOT NULL, 
 routes_attempted INT NOT NULL,
 is_team_member BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id))
'''
cursor.execute(create_climber)
conn.commit()


# Create administrator table 
create_admin = '''
CREATE TABLE admin
(person_id INT NOT NULL,
 has_edit_permission BOOLEAN NOT NULL, 
 has_delete_permission BOOLEAN NOT NULL, 
 has_create_permission BOOLEAN NOT NULL, 
 is_owner BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id))
'''
cursor.execute(create_admin)
conn.commit()

# Print out all of the create statements 
print(create_location,';\n')
print(create_person,';\n')
print(create_route,';\n')
print(create_log,';\n')
print(create_route_setting,';\n')
print(create_route_setter,';\n')
print(create_climber,';\n')
print(create_admin,';')

CREATE TABLE location
(location_id INT NOT NULL AUTO_INCREMENT,
 latitude DECIMAL(10,8) NOT NULL,
 longitude DECIMAL(10,8) NOT NULL,
 name VARCHAR(64) NOT NULL,
 entrance_city VARCHAR(255),
 entrance_zip VARCHAR(255),
 entrance_address VARCHAR(255),
 num_routes INT NOT NULL,
 PRIMARY KEY (location_id),
 CONSTRAINT Check_Location CHECK (-180<longitude AND longitude<180 AND -90<latitude AND latitude<90)
 )
 ;


CREATE TABLE person
(person_id INT NOT NULL AUTO_INCREMENT,
 f_name VARCHAR(32) NOT NULL,
 l_name VARCHAR(32) NOT NULL,
 email VARCHAR(64) NOT NULL,
 phone BIGINT(10) NOT NULL,
 PRIMARY KEY (person_id))
 ;


CREATE TABLE route
(route_id INT NOT NULL AUTO_INCREMENT,
 name VARCHAR(64) NOT NULL,
 difficulty DECIMAL NOT NULL,
 rating DECIMAL,
 type enum('indoor','outdoor') NOT NULL,
 location_id INT NOT NULL,
 PRIMARY KEY (route_id),
 FOREIGN KEY (location_id) REFERENCES location (location_id),
 CONSTRAINT check_rating CHECK (rating>=0 AND rating<=10),
 CONSTRAINT check_difficulty CHECK (difficulty>=0 AND difficulty<=6))
 ;


CREATE TABLE log
(log_id INT NOT NULL AUTO_INCREMENT,
 person_id INT NOT NULL,
 comment LONGTEXT NOT NULL,
 route_beta LONGTEXT,
 route_id INT NOT NULL,
 PRIMARY KEY (log_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id))
 ;


CREATE TABLE route_setting
(route_id INT NOT NULL,
 person_id INT NOT NULL,
 PRIMARY KEY (route_id, person_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id))
 ;


CREATE TABLE route_setter
(person_id INT NOT NULL,
 n_routes_created INT NOT NULL,
 route_setting_exp_lvl DECIMAL NOT NULL,
 certifications LONGTEXT,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id))
 ;


CREATE TABLE climber
(person_id INT NOT NULL,
 exp_lvl DECIMAL NOT NULL,
 routes_attempted INT NOT NULL,
 is_team_member BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id))
 ;


CREATE TABLE admin
(person_id INT NOT NULL,
 has_edit_permission BOOLEAN NOT NULL,
 has_delete_permission BOOLEAN NOT NULL,
 has_create_permission BOOLEAN NOT NULL,
 is_owner BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id))
 ;

# Generate Data

In [20]:
# Function to generate climb names 
first_name = ['willy','ron','shrimp','nano','egret','cozy','perry',
              'darnel','michael','grace','zach','veer','tyler','sherry',
              'rachel','andrew','abi','alyssa','brooke','alex','andy']
last_name = ['parnel','patel','clift','key','dixon','vincil',
             'lloyd','scott','halpert','beesly','bridges','stanmeyer',
             'porter','kelly','lebo','stewart']
adj = ['indubious','scary-ass','incredible','lame-ass','hard-ass',
       'piece-of-cake','cringy','timid','terrible','inspiring','awful',
       'tricky','downright-difficult']
noun = ['bluff','squeeze','tumble','hurdle','boulder-problem',
         'challenge','manuever','scramble','hike','ascent']
email = ['hotmail','gmail','yahoo','b2x.online']
parks = ['blueridge','appalachain','shenendoah','smoky','george washington',
         'montauk','luray','crozet','charlottesville','old rag','humpback','mcafees']
park_2 = ['national park', 'state park', 'nature preserve', 'reservoir', 'park', 
          'mountain', 'rocks', 'preserve', 'wildlife preserve']
list_names = [first_name, last_name]
list_climbs = [first_name, adj, noun]

# Returns a string of climb names 
def generate_climbs():
    name = ''
    i = 0
    for sublist in list_climbs:
        idx = rand.randint(0,len(sublist))
        if i==0:
            name+=sublist[idx]+"'s"
        else: 
            name+=' '+sublist[idx]
        i+=1
    return name

# Returns a tuple of first and last name 
def generate_person():
    name = []
    for sublist in list_names:
        idx = rand.randint(0,len(sublist))
        name.append(sublist[idx])
    return name[0], name[1]

# Return email address 
def generate_email(f_name,l_name):
    idx = rand.randint(0, len(email))
    address = email[idx]
    return f_name+'_'+l_name+'@'+address+'.com'
    
# Return phone number
def generate_phone(base=434):
    return int(str(base)+str(rand.randint(1000000,9999999)))

# Generate Location coordinates 
def generate_coords():
    lat = random.uniform(-77.5,-79.5)
    long = random.uniform(-37,-39)
    return lat, long

# Generate a location name
def generate_location_names():
    return parks[random.randint(0,len(parks)-1)] +' '+ park_2[random.randint(0,len(park_2)-1)]

In [21]:
# Set hyperparameters for data generation 
n_obs_people = 15
n_obs_routes = 20
n_obs_location = 10

In [22]:
# GENERATE LOCATIONS DATA 
location_dataframe = pd.read_sql('location', con=cnx)
for i in range(n_obs_location):
    lat, long = generate_coords()
    vals = {'location_id':i+1, 'latitude':lat,'longitude':long,'name':generate_location_names(),'entrance_city':np.nan,
           'entrance_zip':np.nan, 'entrance_address':np.nan,'num_routes':np.nan}
    location_dataframe = location_dataframe.append(vals, ignore_index=True)

# GENERATE ROUTE DATA 
route_dataframe = pd.read_sql('route', con=cnx)
for i in range(n_obs_routes):
    climb_diff = random.choice(np.linspace(4,6,21))
    climb_rate = random.choice(np.linspace(4,10,13))
    location_id = random.choice(location_dataframe['location_id'].to_list())
    vals = {'route_id':i+1, 'name':generate_climbs(),'difficulty':climb_diff, 'rating':climb_rate, 
           'type':'outdoor', 'location_id':location_id}
    route_dataframe = route_dataframe.append(vals, ignore_index=True)
def try_location(key):
    data = route_dataframe.groupby('location_id').apply(len).to_dict()
    a = 0
    try:
        data[key]
    except:
        pass
    else: 
        a = data[key]
    return a
location_dataframe['num_routes'] = location_dataframe.location_id.apply(try_location)

# GENERATE PEOPLE DATA 
people_dataframe = pd.read_sql('person', con=cnx)
for i in range(n_obs_people):
    f,l =generate_person()
    mail=generate_email(f,l)
    phone=generate_phone()
    vals = {'person_id':i+1,'f_name':f, 'l_name':l, 'email':mail, 'phone':phone}
    people_dataframe = people_dataframe.append(vals, ignore_index=True)

# GENERATE CLIMBER DATA 
climber_dataframe = pd.read_sql('climber', con=cnx)
pct_climbers = .9
climbers_list = people_dataframe.sample(int(pct_climbers*len(people_dataframe)))['person_id'].to_list()
for i in range(len(climbers_list)):
    max_v = len(route_dataframe)
    routes_attempted = rand.randint(0,max_v)
    vals = {'person_id':climbers_list[i],
            'exp_lvl':min(10, round((1-math.tanh((max_v-routes_attempted)/max_v))*9 + 2*rand.uniform(),1)),
            'routes_attempted':routes_attempted, 
            'is_team_member':rand.choice([True,False],p=[.7,.3])}
    climber_dataframe = climber_dataframe.append(vals, ignore_index=True)

# GENERATE ROUTE SETTING data 
route_setting_dataframe = pd.read_sql('route_setting', con=cnx)
route_setters_list = climber_dataframe.sort_values('exp_lvl',ascending=False).sample(int(.3*len(climber_dataframe)))['person_id'].to_list()
for i in range(len(route_dataframe)):
    randn_setters = random.randint(1,len(route_setters_list))
    person_ids = rand.choice(route_setters_list)
    for j in range(randn_setters):
        person = route_setters_list[j]
        route = route_dataframe['route_id'].iloc[i]
        vals = {'route_id':route,'person_id':person}
        route_setting_dataframe = route_setting_dataframe.append(vals, ignore_index=True)

# GENERATE ROUTE SETTER data 
route_setter_dataframe = pd.read_sql('route_setter', con=cnx)
person_ids = route_setting_dataframe.groupby('person_id').apply(len).index.to_list()
n_routes = route_setting_dataframe.groupby('person_id').apply(len).to_list()
for i in range(len(person_ids)):
    max_v = max(n_routes)
    vals = {'person_id':person_ids[i],
            'n_routes_created':n_routes[i],
            'route_setting_exp_lvl':min(10, round((1-math.tanh((max_v-n_routes[i])/max_v))*9 + 1*rand.uniform(),1))}
    route_setter_dataframe = route_setter_dataframe.append(vals, ignore_index=True)

# GENERATE ADMIN data
admin_list = people_dataframe.loc[people_dataframe.person_id.apply(lambda x: x not in climbers_list),'person_id'].to_list()+climber_dataframe.sample(2)['person_id'].to_list()
admin_dataframe = pd.read_sql('admin', con=cnx)
for i in range(len(admin_list)):
    vals = {'person_id':admin_list[i],
            'has_edit_permission':rand.choice([True,False],p=[.9,.1]),
            'has_delete_permission':rand.choice([True,False],p=[.9,.1]),
            'has_create_permission':rand.choice([True,False],p=[.9,.1]),
            'is_owner':rand.choice([True,False],p=[.1,.9])}
    admin_dataframe = admin_dataframe.append(vals, ignore_index=True)
    
# GENERATE LOG DATA 
n_logs = 5
log_dataframe = pd.read_sql('log', con=cnx)
log_dataframe['log_id'] = [1,2,3,4,5]
log_dataframe['person_id'] = rand.choice(climber_dataframe.loc[climber_dataframe['routes_attempted']!=0,'person_id'].to_list(),n_logs)
log_dataframe['comment'] = ['lots of fun, very easy course',
                             'hella dangerous without proper equipment',
                             'name is deceptive: easiest course at blueridge',
                             'too easy not worth the drive',
                             'more of a steep climb with small amounts of bouldering']
log_dataframe['route_beta'] = ['toe hook on sharp ledge marked with chalk',
                               'dyno from hold marked 2 onto blue overhang marked 5',
                               'use the crack to the left of red marker as primary hand hold',
                               'karate kick over between boulders',
                               'mantle blue ledge']
log_dataframe['route_id'] = rand.choice(route_dataframe.loc[:,'route_id'].to_list(),n_logs)

# Insert Data into Database

In [23]:
# Insert all people records
for i in range(len(people_dataframe)):
    row_entry = str(people_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(")
    columns = str(people_dataframe.columns[1:].to_list()).replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO person "+columns+" VALUES "+row_entry
    print("INSERT INTO person "+columns,"\nVALUES "+row_entry,';')
    cursor.execute(command)
    conn.commit()

INSERT INTO person (f_name, l_name, email, phone)
VALUES ('perry', 'clift', 'perry_clift@b2x.online.com', 4344108829) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('darnel', 'vincil', 'darnel_vincil@yahoo.com', 4341282295) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('rachel', 'beesly', 'rachel_beesly@gmail.com', 4348000329) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('nano', 'patel', 'nano_patel@gmail.com', 4347491083) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('darnel', 'stanmeyer', 'darnel_stanmeyer@yahoo.com', 4346594925) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('michael', 'clift', 'michael_clift@hotmail.com', 4345465105) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('brooke', 'kelly', 'brooke_kelly@gmail.com', 4345638747) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('veer', 'stewart', 'veer_stewart@yahoo.com', 4341297838) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('tyler', 'lloyd', 'tyler_lloyd@hotmail.com', 4348638372) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('brooke', 'porter', 'brooke_porter@gmail.com', 4349518670) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('willy', 'stewart', 'willy_stewart@b2x.online.com', 4344990282) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('alex', 'beesly', 'alex_beesly@b2x.online.com', 4347259153) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('abi', 'stewart', 'abi_stewart@yahoo.com', 4346144294) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('ron', 'bridges', 'ron_bridges@gmail.com', 4345468730) ;
INSERT INTO person (f_name, l_name, email, phone)
VALUES ('nano', 'patel', 'nano_patel@hotmail.com', 4347579583) ;

In [24]:
# Insert all location records 
for i in range(len(location_dataframe)):
    row_entry = str(location_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(").replace(' nan,','')
    columns = str(['latitude', 'longitude', 'name', 'num_routes'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO location "+columns+" VALUES "+row_entry
    print("INSERT INTO person "+columns,"\nVALUES "+row_entry,';')
    cursor.execute(command)
    conn.commit()

INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-77.62402697704553, -38.38496717132098, 'blueridge national park', 2) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-78.89309470745178, -38.35389271862398, 'appalachain nature preserve', 3) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-78.80473161594003, -38.26004235036252, 'charlottesville preserve', 3) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-77.72359328282813, -38.5287998697272, 'mcafees nature preserve', 1) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-77.59313354311757, -38.60342759781965, 'montauk reservoir', 1) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-78.65274116524954, -38.413719294617984, 'montauk mountain', 2) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-78.04197808228136, -38.24566204673845, 'crozet national park', 2) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-79.42626582655942, -38.141823207494596, 'appalachain nature preserve', 1) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-78.62622036248334, -37.56428107732624, 'montauk mountain', 3) ;
INSERT INTO person (latitude, longitude, name, num_routes)
VALUES (-79.47731162699904, -37.92402229568982, 'old rag reservoir', 2) ;

In [25]:
# Insert all route data 
for i in range(len(route_dataframe)):
    row_entry = str(route_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(")
    columns = str(['name', 'difficulty', 'rating', 'type', 'location_id'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO route "+columns+" VALUES "+row_entry
    print("INSERT INTO person "+columns,"\nVALUES "+row_entry,';')
    cursor.execute(command)
    conn.commit()

INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("grace's incredible scramble", 4.7, 6.5, 'outdoor', 3) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("ron's downright-difficult scramble", 5.0, 4.0, 'outdoor', 1) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("andrew's cringy scramble", 5.5, 8.5, 'outdoor', 7) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("egret's downright-difficult hurdle", 6.0, 6.0, 'outdoor', 10) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("shrimp's inspiring tumble", 5.5, 7.5, 'outdoor', 5) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("ron's downright-difficult challenge", 5.7, 7.0, 'outdoor', 9) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("rachel's terrible tumble", 6.0, 9.0, 'outdoor', 2) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("perry's inspiring hurdle", 5.2, 5.0, 'outdoor', 6) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("michael's inspiring tumble", 4.1, 9.5, 'outdoor', 4) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("sherry's cringy bluff", 4.4, 7.5, 'outdoor', 3) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("brooke's inspiring hike", 5.9, 5.0, 'outdoor', 9) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("grace's cringy challenge", 5.5, 9.0, 'outdoor', 7) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("perry's piece-of-cake bluff", 4.2, 7.0, 'outdoor', 9) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("andy's incredible manuever", 5.7, 5.0, 'outdoor', 8) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("shrimp's terrible boulder-problem", 5.3, 7.5, 'outdoor', 2) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("ron's scary-ass manuever", 4.9, 8.5, 'outdoor', 1) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("veer's lame-ass challenge", 4.9, 4.5, 'outdoor', 6) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("alyssa's hard-ass tumble", 4.4, 8.0, 'outdoor', 2) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("andrew's inspiring manuever", 5.1, 8.5, 'outdoor', 3) ;
INSERT INTO person (name, difficulty, rating, type, location_id)
VALUES ("perry's terrible boulder-problem", 6.0, 10.0, 'outdoor', 10) ;

In [26]:
# Insert all route_setter data 
for i in range(len(route_setting_dataframe)):
    row_entry = str(route_setting_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(")
    columns = str(['route_id','person_id'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO route_setting "+columns+" VALUES "+row_entry
    print(command,';')
    cursor.execute(command)
    conn.commit()

INSERT INTO route_setting (route_id, person_id) VALUES (1, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (2, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (2, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (2, 14) ;
INSERT INTO route_setting (route_id, person_id) VALUES (3, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (3, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (4, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (4, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (5, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (5, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (5, 14) ;
INSERT INTO route_setting (route_id, person_id) VALUES (6, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (6, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (7, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (7, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (8, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (8, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (9, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (10, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (11, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (11, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (12, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (12, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (13, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (14, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (14, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (14, 14) ;
INSERT INTO route_setting (route_id, person_id) VALUES (15, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (15, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (15, 14) ;
INSERT INTO route_setting (route_id, person_id) VALUES (16, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (16, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (17, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (17, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (18, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (18, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (19, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (19, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (20, 9) ;
INSERT INTO route_setting (route_id, person_id) VALUES (20, 1) ;
INSERT INTO route_setting (route_id, person_id) VALUES (20, 14) ;

In [27]:
# Insert all route_setting data 
for i in range(len(route_setter_dataframe)):
    row_entry = str(route_setter_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','n_routes_created','route_setting_exp_lvl','certifications'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO route_setter "+columns+" VALUES "+row_entry
    print(command,';')
    cursor.execute(command)
    conn.commit()

INSERT INTO route_setter (person_id, n_routes_created, route_setting_exp_lvl, certifications) VALUES (1.0, 16.0, 7.5, NULL) ;
INSERT INTO route_setter (person_id, n_routes_created, route_setting_exp_lvl, certifications) VALUES (9.0, 20.0, 9.9, NULL) ;
INSERT INTO route_setter (person_id, n_routes_created, route_setting_exp_lvl, certifications) VALUES (14.0, 5.0, 3.9, NULL) ;

In [28]:
# Insert all climber data 
for i in range(len(climber_dataframe)):
    row_entry = str(climber_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','exp_lvl','routes_attempted','is_team_member'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO climber "+columns+" VALUES "+row_entry
    print(command,';')
    cursor.execute(command)
    conn.commit()

INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (10.0, 2.3, 0.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (7.0, 5.9, 8.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (2.0, 9.4, 19.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (5.0, 3.7, 3.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (9.0, 8.5, 18.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (1.0, 9.7, 19.0, 1.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (4.0, 3.7, 2.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (8.0, 5.7, 10.0, 1.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (6.0, 4.9, 5.0, 1.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (12.0, 8.0, 16.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (14.0, 5.9, 12.0, 0.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (11.0, 9.3, 17.0, 1.0) ;
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (15.0, 3.2, 0.0, 1.0) ;

In [29]:
# Insert all admin data  
for i in range(len(admin_dataframe)):
    row_entry = str(admin_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','has_edit_permission','has_delete_permission','has_create_permission','is_owner'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO admin "+columns+" VALUES "+row_entry
    print("INSERT INTO person "+columns,"\nVALUES "+row_entry,';')    
    cursor.execute(command)
    conn.commit()

INSERT INTO person (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (3, 0, 1, 0, 0) ;
INSERT INTO person (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (13, 0, 1, 1, 0) ;
INSERT INTO person (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (7, 1, 1, 1, 0) ;
INSERT INTO person (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (10, 0, 1, 1, 0) ;

In [30]:
# Insert all log data 
for i in range(len(log_dataframe)):
    row_entry = str(log_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','comment','route_beta','route_id'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO log "+columns+" VALUES "+row_entry
    print("INSERT INTO person "+columns,"\nVALUES "+row_entry,';')    
    cursor.execute(command)
    conn.commit()

INSERT INTO person (person_id, comment, route_beta, route_id)
VALUES (2, 'lots of fun, very easy course', 'toe hook on sharp ledge marked with chalk', 16) ;
INSERT INTO person (person_id, comment, route_beta, route_id)
VALUES (4, 'hella dangerous without proper equipment', 'dyno from hold marked 2 onto blue overhang marked 5', 13) ;
INSERT INTO person (person_id, comment, route_beta, route_id)
VALUES (12, 'name is deceptive: easiest course at blueridge', 'use the crack to the left of red marker as primary hand hold', 1) ;
INSERT INTO person (person_id, comment, route_beta, route_id)
VALUES (8, 'too easy not worth the drive', 'karate kick over between boulders', 2) ;
INSERT INTO person (person_id, comment, route_beta, route_id)
VALUES (2, 'more of a steep climb with small amounts of bouldering', 'mantle blue ledge', 12) ;

# Retrieve your data

## Select all data

In [31]:
# Person Data Table
command = "SELECT * FROM person"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM person

    person_id   f_name     l_name                         email       phone
0           1    perry      clift    perry_clift@b2x.online.com  4344108829
1           2   darnel     vincil       darnel_vincil@yahoo.com  4341282295
2           3   rachel     beesly       rachel_beesly@gmail.com  4348000329
3           4     nano      patel          nano_patel@gmail.com  4347491083
4           5   darnel  stanmeyer    darnel_stanmeyer@yahoo.com  4346594925
5           6  michael      clift     michael_clift@hotmail.com  4345465105
6           7   brooke      kelly        brooke_kelly@gmail.com  4345638747
7           8     veer    stewart        veer_stewart@yahoo.com  4341297838
8           9    tyler      lloyd       tyler_lloyd@hotmail.com  4348638372
9          10   brooke     porter       brooke_porter@gmail.com  4349518670
10         11    willy    stewart  willy_stewart@b2x.online.com  4344990282
11         12     alex     beesly    alex_beesly@b2x.online.com  4347259153
12         13      abi    stewart         abi_stewart@yahoo.com  4346144294
13         14      ron    bridges         ron_bridges@gmail.com  4345468730
14         15     nano      patel        nano_patel@hotmail.com  4347579583

In [32]:
# Route Data Table
command = "SELECT * FROM route"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM route

,route_id,name,difficulty,rating,type,location_id
0,1,grace's incredible scramble,5.0,7.0,outdoor,3
1,2,ron's downright-difficult scramble,5.0,4.0,outdoor,1
2,3,andrew's cringy scramble,6.0,9.0,outdoor,7
3,4,egret's downright-difficult hurdle,6.0,6.0,outdoor,10
4,5,shrimp's inspiring tumble,6.0,8.0,outdoor,5
5,6,ron's downright-difficult challenge,6.0,7.0,outdoor,9
6,7,rachel's terrible tumble,6.0,9.0,outdoor,2
7,8,perry's inspiring hurdle,5.0,5.0,outdoor,6
8,9,michael's inspiring tumble,4.0,10.0,outdoor,4
9,10,sherry's cringy bluff,4.0,8.0,outdoor,3
10,11,brooke's inspiring hike,6.0,5.0,outdoor,9
11,12,grace's cringy challenge,6.0,9.0,outdoor,7
12,13,perry's piece-of-cake bluff,4.0,7.0,outdoor,9
13,14,andy's incredible manuever,6.0,5.0,outdoor,8
14,15,shrimp's terrible boulder-problem,5.0,8.0,outdoor,2
15,16,ron's scary-ass manuever,5.0,9.0,outdoor,1
16,17,veer's lame-ass challenge,5.0,5.0,outdoor,6
17,18,alyssa's hard-ass tumble,4.0,8.0,outdoor,2
18,19,andrew's inspiring manuever,5.0,9.0,outdoor,3
19,20,perry's terrible boulder-problem,6.0,10.0,outdoor,10

In [33]:
# Location Data Table
command = "SELECT * FROM location"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM location

,location_id,latitude,longitude,name,entrance_city,entrance_zip,entrance_address,num_routes
0,1,-77.624027,-38.384967,blueridge national park,None,None,None,2
1,2,-78.893095,-38.353893,appalachain nature preserve,None,None,None,3
2,3,-78.804732,-38.260042,charlottesville preserve,None,None,None,3
3,4,-77.723593,-38.528800,mcafees nature preserve,None,None,None,1
4,5,-77.593134,-38.603428,montauk reservoir,None,None,None,1
5,6,-78.652741,-38.413719,montauk mountain,None,None,None,2
6,7,-78.041978,-38.245662,crozet national park,None,None,None,2
7,8,-79.426266,-38.141823,appalachain nature preserve,None,None,None,1
8,9,-78.626220,-37.564281,montauk mountain,None,None,None,3
9,10,-79.477312,-37.924022,old rag reservoir,None,None,None,2

In [34]:
# Route Setting Data Table 
command = "SELECT * FROM route_setting"
print(command)
pd.read_sql(command,con=cnx).sort_values(by='route_id').reset_index(drop=True)

SELECT * FROM route_setting

    route_id  person_id
0          1          9
1          2          1
2          2         14
3          2          9
4          3          1
5          3          9
6          4          1
7          4          9
8          5         14
9          5          9
10         5          1
11         6          1
12         6          9
13         7          9
14         7          1
15         8          1
16         8          9
17         9          9
18        10          9
19        11          1
20        11          9
21        12          1
22        12          9
23        13          9
24        14          9
25        14         14
26        14          1
27        15          9
28        15          1
29        15         14
30        16          9
31        16          1
32        17          9
33        17          1
34        18          9
35        18          1
36        19          1
37        19          9
38        20          1
39        20          9
40        20         14

In [35]:
# Route log data table 
command = "SELECT * FROM log"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM log

,log_id,person_id,comment,route_beta,route_id
0,1,2,"lots of fun, very easy course",toe hook on sharp ledge marked with chalk,16
1,2,4,hella dangerous without proper equipment,dyno from hold marked 2 onto blue overhang mar...,13
2,3,12,name is deceptive: easiest course at blueridge,use the crack to the left of red marker as pri...,1
3,4,8,too easy not worth the drive,karate kick over between boulders,2
4,5,2,more of a steep climb with small amounts of bo...,mantle blue ledge,12

In [36]:
# Route Setter Data 
command = "SELECT * FROM route_setter"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM route_setter

   person_id  n_routes_created  route_setting_exp_lvl certifications
0          1                16                    8.0           None
1          9                20                   10.0           None
2         14                 5                    4.0           None

In [37]:
# Climber Data Table
command = "SELECT * FROM climber"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM climber

    person_id  exp_lvl  routes_attempted  is_team_member
0           1     10.0                19               1
1           2      9.0                19               0
2           4      4.0                 2               0
3           5      4.0                 3               0
4           6      5.0                 5               1
5           7      6.0                 8               0
6           8      6.0                10               1
7           9      9.0                18               0
8          10      2.0                 0               0
9          11      9.0                17               1
10         12      8.0                16               0
11         14      6.0                12               0
12         15      3.0                 0               1

In [38]:
# Admin Data Table
command = "SELECT * FROM admin"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM admin

,person_id,has_edit_permission,has_delete_permission,has_create_permission,is_owner
0,3,0,1,0,0
1,7,1,1,1,0
2,10,0,1,1,0
3,13,0,1,1,0

## Select Rows Queries

In [41]:
# Get the contact info for all route setters 
command = '''
SELECT f_name, l_name, email, phone
FROM person NATURAL JOIN route_setter
'''
print(command)
pd.read_sql(command,con=cnx)

SELECT f_name, l_name, email, phone
FROM person NATURAL JOIN route_setter

  f_name   l_name                       email       phone
0  perry    clift  perry_clift@b2x.online.com  4344108829
1  tyler    lloyd     tyler_lloyd@hotmail.com  4348638372
2    ron  bridges       ron_bridges@gmail.com  4345468730

In [47]:
# Get list of all people who are admin AND climbers
command = '''
SELECT person_id, f_name, l_name 
FROM person NATURAL JOIN admin NATURAL JOIN climber
'''
print(command)
pd.read_sql(command,con=cnx)

SELECT person_id, f_name, l_name
FROM person NATURAL JOIN admin NATURAL JOIN climber

   person_id  f_name  l_name
0          7  brooke   kelly
1         10  brooke  porter

In [50]:
# Get all of the locations EAST (lower longitude) of charlottesville preserve
command = '''
SELECT location_id, name, latitude, longitude
FROM location
WHERE longitude < (SELECT longitude
                   FROM location
                   WHERE name='charlottesville preserve')
'''
print(command)
pd.read_sql(command,con=cnx)

SELECT location_id, name, latitude, longitude
FROM location
WHERE longitude < (SELECT longitude
                   FROM location
                   WHERE name='charlottesville preserve')

   location_id                         name   latitude  longitude
0            1      blueridge national park -77.624027 -38.384967
1            2  appalachain nature preserve -78.893095 -38.353893
2            4      mcafees nature preserve -77.723593 -38.528800
3            5            montauk reservoir -77.593134 -38.603428
4            6             montauk mountain -78.652741 -38.413719

## Select Summarize Queries

In [ ]:
# SQL command to summarize data

In [410]:
# Close your connection 
conn.close()